Revit 2027 API
BuiltInFailures.JoinElementsFailures.CannotKeepJoined Property
 Can't keep elements joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotKeepJoined { get; }
Public Shared ReadOnly Property CannotKeepJoined As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotKeepJoined {
	FailureDefinitionId^ get ();
}
static member CannotKeepJoined : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace